FKDD_COPY_DIFF_3_2026-02-13/Catalogs/УчетныеЗаписиЭлектроннойПочты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиЭлектроннойПочты</Name>
			<Comment>В справочнике хранятся учетные записи электронной почты,  используемые в почтовой подсистеме</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>POP3Сервер</Name>
					<Comment>Интернет адрес  POP3 сервера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMTPСервер</Name>
					<Comment>Интернет адрес  SMTP сервера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>Адрес электронной почты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжиданияСервера</Name>
					<Comment>Время ожидания ответа сервера при попытки соединения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Comment>Логин пользователя почтового ящика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинSMTP</Name>
					<Comment>Логин  SMTP сервера при SMTP аутентификации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Comment>Пароль пользователя почтового ящика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольSMTP</Name>
					<Comment>Пароль  SMTP сервера при SMTP аутентификации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Представление пользователя почтового ящика, используется для заполнения по умолчанию  поля "От"  в новых электронных письмах</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортPOP3</Name>
					<Comment>Порт  POP3 сервера</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортSMTP</Name>
					<Comment>Порт  SMTP сервера</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьСообщенияССервера</Name>
					<Comment>Признак удаления почтового сообщения с почтового сервера после его получения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейУдаленияПисемССервера</Name>
					<Comment>Количество дней до удаления писем с сервера</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоПолучениеОтправкаСообщений</Name>
					<Comment>Авто получение / отправка сообщений</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалАвтоПолученияОтправкиСообщений</Name>
					<Comment>Интервал автополучения / отправки сообщений</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеАвтополученияОтправкиСообщений</Name>
					<Comment>Действие при автополучении или отправки сообщений</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействийАвтоПолученияОтправкиЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтосохранениеПисем</Name>
					<Comment>Автосохранение писем</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалАвтосохраненияПисем</Name>
					<Comment>Интервал автосохранения писем</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическаяУстановкаПометкиРассмотрено</Name>
					<Comment>Автоматическая установка пометки "рассмотрено"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалАвтоматическойУстановкиОтметкиРассмотрено</Name>
					<Comment>Интервал автоматической установки отметки "Рассмотрено"</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьПисьмаССервераЧерез</Name>
					<Comment>Количество дней, по истечению которого письма будут удалены с сервера</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическаяУстановкаПометкиРассмотреноПриОтвете</Name>
					<Comment>Автоматическая установка пометки "рассмотрено" при ответе</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийДоступ</Name>
					<Comment>Признак, что это учетная запись для общего доступа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаАвтоПолучениеОтправкуСообщений</Name>
					<Comment>Пользователь, ответственный за авто-получение  и отправку сообщений</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповещатьОбАвтополученииПочты</Name>
					<Comment>Включать учетную запись в напоминание об автополучении почты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоУчетнаяЗаписьНовостей</Name>
					<Comment>Признак учетной записи новостей</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЭлектроннойПочтыДляОтвета</Name>
					<Comment>Адрес электронной почты для ответа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияSMTP</Name>
					<Comment>Аутентификация SMTP</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособАутентификацииSMTP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АутентификацияPOP3</Name>
					<Comment>Аутентификация POP3</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособАутентификацииPOP3</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>POP3ПередSMTP</Name>
					<Comment>Способ аутентификации, когда подключение к SMTP серверу происходит после успешного подключения к POP3 серверу</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьPOPSSL</Name>
					<Comment>Использовать SSL для POP сервера</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьSMTPSSL</Name>
					<Comment>Использовать SSL для SMTP сервера</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриниматьПисьмаПриСтартеСистемы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейПриемаНовойПочты</Name>
					<Comment>Органичение на прием писем при старте системы за определенное количество дней. 0 - письма принимаются все, 1 - принимаются письма только за 1 последний день.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПротоколВходящейПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пользователи</Name>
					<Comment>Содержит список пользователей для которых доступна учетная запись</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Comment>Уникальный</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Администрирование</Name>
							<Comment>Флаг разрешения администрирования учетной записи</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Редактирование</Name>
							<Comment>Флаг разрешения создания/редактирования писем данной учетной записи</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Транспорт</Name>
							<Comment>Флаг разрешения получения/отправки писем данной учетной записи</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетнаяЗаписьПоУмолчанию</Name>
							<Comment>Признак что это учетная запись по умолчанию данного пользователя</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/СпособАутентификацииSMTP.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособАутентификацииSMTP</Name>
			<Comment>Способ аутентификации SMTP</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезАутентификации</Name>
					<Comment>Без аутентификации</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Login</Name>
					<Comment>Способ аутентификации на SMTP сервере - Login</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Plain</Name>
					<Comment>Способ аутентификации на SMTP сервере - Plain</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CramMD5</Name>
					<Comment>Способ аутентификации на SMTP сервере - CRAM-MD5</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Comment>Определяются поддерживаемые сервером способы аутентификации и используется первый из списка</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/УчетныеЗаписиЭлектроннойПочты/Ext/ObjectModule.bsl
// Модуль справочника

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;	  // Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем ЭтотОбъектНовый;    // Нужно создать группы писем только для новых объектов, но после записи объекта 
					      // в переменной хранится признак что учетная запись новая.
Перем Скопирован Экспорт; // Признак что элемент создан копированием						

Перем СтандартныйАдресRSS; // Адрес по умолчанию

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов элемента
// Если ДляЭлемента = Истина, возвращаемая структура содержит реквизиты для проверки элемента
// Если ДляГруппы = Истина, аналогично для группы
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 3-Уникальный
Функция ПолучитьОбязательныеРеквизиты(ДляЭлемента=Истина, ДляГруппы=Ложь) Экспорт
	ОбязательныеРеквизиты = Новый Структура();
	ОбязательныеРеквизиты.Вставить("Код",1);
	ОбязательныеРеквизиты.Вставить("Наименование",3);
	
	Если ДляЭлемента И (НЕ ЭтоУчетнаяЗаписьНовостей)Тогда
		
		Если НЕ обЗначениеНеЗаполнено(SMTPСервер) Тогда			
			ОбязательныеРеквизиты.Вставить("ПортSMTP",1);  
		КонецЕсли;
		
		Если НЕ обЗначениеНеЗаполнено(POP3Сервер) Тогда
			ОбязательныеРеквизиты.Вставить("АдресЭлектроннойПочты",1);
			ОбязательныеРеквизиты.Вставить("POP3Сервер",1);
			ОбязательныеРеквизиты.Вставить("ПортPOP3",1);
			ОбязательныеРеквизиты.Вставить("Логин",1);
			ОбязательныеРеквизиты.Вставить("Пароль",1);              
			ОбязательныеРеквизиты.Вставить("ВремяОжиданияСервера",1);
		КонецЕсли; 		
	Иначе
		ОбязательныеРеквизиты.Вставить("АдресЭлектроннойПочты",1); 
	КонецЕсли;
	
	Если ДляГруппы Тогда
	КонецЕсли;

	// Обязательные поля таблицы Пользователи
	ОбязательныеПользователи = Новый Структура();
	ОбязательныеПользователи.Вставить("Пользователь",3);
	ОбязательныеРеквизиты.Вставить("Пользователи",ОбязательныеПользователи);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки 			– Строка		– Описание ошибок.
//  ДопРеквизиты	– Структура		– Дополнительные реквизиты для проверки.
//  Заполнение		– Булево		– Флаг для проверки заполнения.
//  Уникальность	– Булево		– Флаг для проверки уникальности.
//
// Возвращаемое значение:
//   Булево				   			– Правильность заполнения объекта.
//
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	
	Если Пользователи.Итог("Администрирование") = 0 Тогда
		Сообщить("Для учетной записи необходимо наличие администратора!
				 |Установите флажок ""Администрирование"" хотя бы для одного пользователя.", СтатусСообщения.Важное);	
		Возврат Ложь;
	КонецЕсли;
	
	Возврат спПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
КонецФункции // ПроверитьКорректность()
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
// Параметры:
//  БлокироватьРеквизиты	– Строка	– Блокируемые на изменение реквизиты объекта.
//
// Возвращаемое значение:
//   Булево		   					– Допустимость изменения объекта.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Обработка изменения реквизитов справочников
//
// Параметры:
//  Имя			– Строка			– Имя реквизита справочника с полным путем.
//  ЭтаФорма	– Форма				– Ссылка на форму справочника. Если значение неопределено,
//									  производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части справочника, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей справочников.
//  ДопПараметры	– Структура		– Структура, содержащая дополнительные параметры обработки реквизита.
//
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
//
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ СПРАВОЧНИКОВ
	Возврат спОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
КонецФункции // ОбработкаРеквизита()

// Процедура создает обязательные группы писем (только для новых учетных записей)
Процедура СоздатьПапкиУчетнойЗаписиПоУмолчанию(Объект = Неопределено) Экспорт
	Входящие     = Истина;
	Исходящие    = Истина;
	Отправленные = Истина;
	Удаленные    = Истина;
	
	Если Объект<>Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыПисемЭлектроннойПочты.Наименование
		|ИЗ
		|	Справочник.ГруппыПисемЭлектроннойПочты КАК ГруппыПисемЭлектроннойПочты
		|ГДЕ
		|	ГруппыПисемЭлектроннойПочты.Владелец = &Владелец
		|	И ГруппыПисемЭлектроннойПочты.Наименование В(&МассивНаименований)";
		МассивНаименований = Новый Массив;
		МассивНаименований.Добавить("Входящие");
		МассивНаименований.Добавить("Исходящие");
		МассивНаименований.Добавить("Отправленные");
		МассивНаименований.Добавить("Удаленные");
		
		Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
		Запрос.УстановитьПараметр("МассивНаименований", МассивНаименований);
		
		тзПапкиУчетнойЗаписи = Запрос.Выполнить().Выгрузить();
		Если тзПапкиУчетнойЗаписи.Найти("Входящие", "Наименование")<>Неопределено Тогда
			Входящие = Ложь;	
		КонецЕсли;
		Если тзПапкиУчетнойЗаписи.Найти("Исходящие", "Наименование")<>Неопределено Тогда
			Исходящие = Ложь;	
		КонецЕсли;
		Если тзПапкиУчетнойЗаписи.Найти("Отправленные", "Наименование")<>Неопределено Тогда
			Отправленные = Ложь;	
		КонецЕсли;
		Если тзПапкиУчетнойЗаписи.Найти("Удаленные", "Наименование")<>Неопределено Тогда
			Удаленные = Ложь;	
		КонецЕсли;				
	КонецЕсли;
	
	ЭтоНовости = ?(Объект=Неопределено, ЭтотОбъект.ЭтоУчетнаяЗаписьНовостей, Объект.ЭтоУчетнаяЗаписьНовостей);
	Если ЭтоНовости Тогда
		Отправленные = Ложь;
		Исходящие    = Ложь;
	КонецЕсли;
	
	Если Входящие Тогда 	
		ГруппыПисемУчетнойЗаписи = Справочники.ГруппыПисемЭлектроннойПочты;
		НоваяГруппа = ГруппыПисемУчетнойЗаписи.СоздатьЭлемент();
		НоваяГруппа.Владелец = ?(Объект=Неопределено, ЭтотОбъект.Ссылка, Объект.Ссылка); 		 
		НоваяГруппа.Наименование = "Входящие";
		НоваяГруппа.УстановитьНовыйКод();
		НоваяГруппа.Записать();
	КонецЕсли;
	Если Исходящие Тогда
		ГруппыПисемУчетнойЗаписи = Справочники.ГруппыПисемЭлектроннойПочты;
		НоваяГруппа = ГруппыПисемУчетнойЗаписи.СоздатьЭлемент();
		НоваяГруппа.Владелец     = ?(Объект=Неопределено, ЭтотОбъект.Ссылка, Объект.Ссылка);
		НоваяГруппа.Наименование = "Исходящие";
		НоваяГруппа.УстановитьНовыйКод();
		НоваяГруппа.Записать();
	КонецЕсли;
	Если Отправленные Тогда
		ГруппыПисемУчетнойЗаписи = Справочники.ГруппыПисемЭлектроннойПочты;
		НоваяГруппа = ГруппыПисемУчетнойЗаписи.СоздатьЭлемент();
		НоваяГруппа.Владелец     = ?(Объект=Неопределено, ЭтотОбъект.Ссылка, Объект.Ссылка);
		НоваяГруппа.Наименование = "Отправленные";
		НоваяГруппа.УстановитьНовыйКод();
		НоваяГруппа.Записать();
	КонецЕсли;
	Если Удаленные Тогда
		ГруппыПисемУчетнойЗаписи = Справочники.ГруппыПисемЭлектроннойПочты;
		НоваяГруппа = ГруппыПисемУчетнойЗаписи.СоздатьЭлемент();
		НоваяГруппа.Владелец     = ?(Объект=Неопределено, ЭтотОбъект.Ссылка, Объект.Ссылка);
		НоваяГруппа.Наименование = "Удаленные";
		НоваяГруппа.УстановитьНовыйКод();
		НоваяГруппа.Записать();
	КонецЕсли;
КонецПроцедуры // СоздатьПапкиУчетнойЗаписиПоУмолчанию()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик заполнения при вводе нового на основании
Процедура ОбработкаЗаполнения(Основание)
	Если НЕ спОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	ПротоколВходящейПочты = "POP3";
КонецПроцедуры // ОбработкаЗаполнения()

// Стандартный обработчик копирования объекта
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ спПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
	Скопирован = Истина;
КонецПроцедуры // ПриКопировании()

// Стандартный обработчик ПередЗаписью элемента справочника
Процедура ПередЗаписью(Отказ)
	
	Если НЕ спПередЗаписью(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	Если ЭтотОбъект.ЭтоНовый() Тогда 
		ЭтотОбъектНовый = Истина;
	Иначе
		ЭтотОбъектНовый = Ложь;
	КонецЕсли;
	
	Если АвтоПолучениеОтправкаСообщений Тогда
		Если обЗначениеНеЗаполнено(ОтветственныйЗаАвтоПолучениеОтправкуСообщений) Тогда
			Сообщить("Не указан ответственный за автополучение/отправку писем.");
			Отказ = Истина;
		ИначеЕсли обЗначениеНеЗаполнено(ИнтервалАвтоПолученияОтправкиСообщений) Тогда
			Сообщить("Не указан интервал автополучения/отправки писем.");
			Отказ = Истина;
		Иначе
			СтрокаТЧ = Пользователи.Найти(ОтветственныйЗаАвтоПолучениеОтправкуСообщений, "Пользователь");
			Если СтрокаТЧ = Неопределено Тогда
				Отказ = Истина;
			Иначе
				Если НЕ СтрокаТЧ.Транспорт Тогда
					Отказ = Истина;
				КонецЕсли; 
			КонецЕсли; 
			Если Отказ Тогда
				Сообщить("У ответственного за автополучение/отправку нет прав на транспорт писем.");
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 

	// Очистим "лишние" реквизиты
	Если обЗначениеНеЗаполнено(SMTPСервер) Тогда
		ПортSMTP = 0;
		АутентификацияSMTP = Перечисления.СпособАутентификацииSMTP.БезАутентификации;
		ЛогинSMTP  = "";
		ПарольSMTP = "";
		POP3ПередSMTP = Ложь;
	КонецЕсли;
	Если обЗначениеНеЗаполнено(POP3Сервер) Тогда
		ПортPOP3 = 0;
		АутентификацияPOP3 = Перечисления.СпособАутентификацииPOP3.Обычная;
		Логин    = "";
		Пароль   = "";
	КонецЕсли;
	
КонецПроцедуры

// Стандартный обработчик ПриЗаписи элемента справочника
Процедура ПриЗаписи(Отказ)
	
	Если НЕ спПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
	
	Если ЭтотОбъектНовый И ЭтоГруппа = Ложь Тогда 
		СоздатьПапкиУчетнойЗаписиПоУмолчанию();		
	КонецЕсли;

КонецПроцедуры // ПриЗаписи()

// Стандартный обработчик ПередУдалением элемента
Процедура ПередУдалением(Отказ)
	Если НЕ спПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

// Стандартный обработчик ПриУстановкеНовогоКода элемента
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоКода()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли

Скопирован = Ложь;
